---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.CannotCopyDisplacementSetIntoOtherDocument
source: html/a2601358-81f1-4bca-35fe-03c85f1a3276.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.CannotCopyDisplacementSetIntoOtherDocument Property

A Displacement Set can only be pasted into a view in the same document in which it was created.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyDisplacementSetIntoOtherDocument { get; }
```